/**
*@directory ClangC11Console / ClanC11Sample / C99YH / C99YH03_Valiable
*@fileName  MainNumericTypeRange.c
*@reference C99YH  åãèÈ ç_ ÅwCåæåÍÉvÉçÉOÉâÉ~ÉìÉOÉåÉbÉXÉì [ì¸ñÂï“] ëÊÇRî≈ÅxSB Creative, 2019
*@reference CAnsi  åãèÈ ç_ ÅwCåæåÍÉvÉçÉOÉâÉ~ÉìÉOÉåÉbÉXÉì [ï∂ñ@ï“] êVî≈Åx  SB Creative, 2006
*@reference C11DS  arton  Åwì∆èK C êVî≈Åx„ƒâjé–, 2018
*
*@content C99YH ëÊÇQèÕ åvéZ, ëÊÇRèÕ ïœêî / List 2-7, 7-7 / p49, p67, p206
*         êîílå^ÇÃóLå¯îÕàÕÇï\é¶
* 
*@English [âp] numeric:  êîílÇÃ
*         [âp] range:    îÕàÕ
* 
*@subject çëç€ïWèÄãKäi IEC60559ÅkC99YH p49, p67Ål
*         Åñchar:         8 bit = 2 ^  8 = 256
*         Åñshort:       16 bit = 2 ^ 16 = 65536
*         Åñint:         32 bit = 2 ^ 32 = 4294967296
*         Åñlong long:   64 bit = 2 ^ 64 = 18446744073709551617
*         Åñfloat:       íPê∏ìxïÇìÆè¨êîì_êîå^    óLå¯åÖêî  6 / ílîÕàÕ -3.4 * 10 ^ 38 Å` 3.4 * 10 ^ 38
*         Åñdouble:      î{ê∏ìxïÇìÆè¨êîì_êîå^    óLå¯åÖêî 15 / ílîÕàÕ -1.7 * 10 ^ 308 Å` 1.7 * 10 ^ 308
*         Åñlong double: ägí£ê∏ìxïÇìÆè¨êîì_êîå^  óLå¯åÖêî 19 / ílîÕàÕ -1.1 * 10 ^ 4932 Å` 1.1 * 10 ^ 4932
* 
*@subject <limits.h>  êÆêîå^ÇÃóLå¯îÕàÕÇíËã` (ÉRÉìÉpÉCÉâÇ…ÇÊÇ¡ÇƒàŸÇ»ÇÈ) ÅkC99YH p49, p206Ål
*                     int Ç∆ long int Ç…à·Ç¢ÇÕÇ»Ç¢
*         #define
*           Ñ§ char:           CHAR_MIN, CHAR_MAX
*           Ñ§ singed char:    SCHAR_MIN, SCHAR_MAX
*           Ñ§ unsigned char:  0, UCHAR_MAX
*           Ñ§ short:          SHRT_MIN, SHRT_MAX
*           Ñ§ unsigned short: 0, USHRT_MAX
*           Ñ§ int:            INT_MIN, INT_MAX
*           Ñ§ unsigned int:   0, UINT_MAX
*           Ñ§ long int:       LONG_MIN, LONG_MAX
*           Ñ§ unsigned long int: 0UL, ULONG_MAX
*           Ñ§ long long int:  LLONG_MIN, LLONG_MAX, 
*           Ñ§ unsignedlong long int:  0ULL, ULLONG_MAX, 
* 
*         ÅüRange of Integer Type (in this Compiler)
*         Åñchar  :       -128 Å` 127
*         Åñsinged char:  -128 Å` 127
*         Åñunsinged char: 0 Å` 255
*         Åñshort : -32768 Å` 32767
*         Åñint   : -2147483648 Å` 2147483647
*         Åñlong  : -2147483648 Å` 2147483647
*         Åñllong : -9223372036854775808 Å` 9223372036854775807
*
*@subject <stdint.h>  ïÑçÜÇ»ÇµêÆêîå^ÇÃóLå¯îÕàÕÇíËã` (ÉRÉìÉpÉCÉâÇ…ÇÊÇ¡ÇƒàŸÇ»ÇÈ) ÅkC11DS p76Ål
*                     printf("%d", T value) 
*                       -> %d: int / %lld: long long / %f: float
*                       -> %i: int / %lli: long long / %u: uint / %llu: unsiged long long
*                     å^ÇÃóLå¯îÕàÕÇí¥Ç¶ÇÈèÍçáÇÕ -1 Ç∆ï\é¶Ç≥ÇÍÇÈ
*                     unsigned ÇÃ MIN ÇÕ 0 Ç»ÇÃÇ≈ÅAíËã`Ç≥ÇÍÇƒÇ¢Ç»Ç¢ÅB
*         #define
*           Ñ§ int8_t:   INT8_MIN, INT8_MAX
*           Ñ§ uint8_t:  UINT8_MAX
*           Ñ§ int16_t:  INT16_MIN, INT16_MAX
*           Ñ§ uint16_t: UINT16_MAX
*           Ñ§ int32_t:  INT32_MIN, INT32_MAX
*           Ñ§ uint32_t: UINT32_MAX
*           Ñ§ int64_t:  INT64_MIN, INT64_MAX
*           Ñ§ uint64_t: UINT64_MAX
* 
*         ÅüRange of Unsigned Integer defined by <stdint.h>
*         Åñint8_t  : -128 Å` 127
*         Åñuint8_t : 0    Å` 255
*         Åñint16_t : -32768 Å` 32767
*         Åñuint16_t: 0      Å` 65535
*         Åñint32_t : -2147483648 Å` 2147483647
*         Åñuint32_t: 0           Å` 4294967295
*         Åñint64_t : -9223372036854775808 Å`  9223372036854775807
*         Åñuint64_t: 0                    Å` 18446744073709551616
* 
*@subject <float.h>  ïÇìÆè¨êîì_êîå^ÇÃóLå¯îÕàÕÇíËã` (ÉRÉìÉpÉCÉâÇ…ÇÊÇ¡ÇƒàŸÇ»ÇÈ)  ÅkC99YH p68Ål
*                    double Ç∆ long double Ç…à·Ç¢ÇÕÇ»Ç¢
*         #define
*           Ñ§ float:       FLT_MIN, FLT_MAX
*           Ñ§ double:      DBL_MIN, DBL_MAX
*           Ñ§ long double: LDBL_MIN, LDBL_MAX
* 
*         ÅüRange of Float Double (in this Compiler)
*         Åñfloat : 0.0000000000000000000000000000000000000118 Å` 340282346638528859811704183484516925440.000000
*         Åñfloat :  1.17549435082228750797e-38 Å` 3.40282346638528859812e+38
*         Åñdouble: 0.0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000223
*                  Å` 179769313486231570814527423731704356798070567525844996598917476803157260780028538760589558632766878171540458953514382464234321326889464182768467546703537516986049910576551282076245490090389328944075868508455133942304583236903222948165808559332123348274797826204144723168738177180919299881250404026184124858368.000000
*         Åñdouble:  2.22507385850720138309e-308 Å` 1.79769313486231570815e+308
*         Åñlong double: 0.0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000223 
*                  Å` 179769313486231570814527423731704356798070567525844996598917476803157260780028538760589558632766878171540458953514382464234321326889464182768467546703537516986049910576551282076245490090389328944075868508455133942304583236903222948165808559332123348274797826204144723168738177180919299881250404026184124858368.000000
*         Åñlong double:  2.22507385850720138309e-308 Å` 1.79769313486231570815e+308
* 
*@copyTo ReferenceDocument\ReferenceNumericTypeRange.txt
*@author shika
*@date 2022-12-10
*/

#include <stdio.h>
#include <limits.h>
#include <stdint.h>
#include <float.h>

//int main(void) {
int mainNumericTypeRange(void) {
    printf("ÅüRange of Integer Type (in this Compiler)\n");
    printf("Åñchar  : %d Å` %d\n", CHAR_MIN, CHAR_MAX);
    printf("Åñshort : %d Å` %d\n", SHRT_MIN, SHRT_MAX);
    printf("Åñint   : %d Å` %d\n", INT_MIN, INT_MAX);
    printf("Åñlong  : %li Å` %li\n", LONG_MIN, LONG_MAX);
    printf("Åñllong : %lli Å` %lli\n", LLONG_MIN, LLONG_MAX);
    printf("\n");

    printf("ÅüRange of Unsigned Integer defined by <stdint.h>\n");
    printf("Åñint8_t: %d Å` %d\n", INT8_MIN, INT8_MAX);
    printf("Åñuint8_t: %d Å` %d\n", 0, UINT8_MAX);
    printf("Åñint16_t: %d Å` %d\n", INT16_MIN, INT16_MAX);
    printf("Åñuint16_t: %d Å` %d\n", 0, UINT16_MAX);
    printf("Åñint32_t: %d Å` %d\n", INT32_MIN, INT32_MAX);
    printf("Åñuint32_t: %d Å` %u\n", 0, UINT32_MAX);
    printf("Åñint64_t: %lld Å` %lld\n", INT64_MIN, INT64_MAX);
    printf("Åñuint64_t: %d Å` %llu\n", 0, UINT64_MAX);
    printf("\n");

    printf("ÅüRange of Float Double (in this Compiler)\n");
    printf("Åñfloat : %.40f \n        Å` %f\n", FLT_MIN, FLT_MAX);
    printf("Åñfloat : %.20e Å` %.20e\n", FLT_MIN, FLT_MAX);
    printf("Åñdouble: %.310f\n        Å` %f\n", DBL_MIN, DBL_MAX);
    printf("Åñdouble: %.20e Å` %.20e\n", DBL_MIN, DBL_MAX);
    printf("Åñlong double: %.310f\n              Å` %f\n", LDBL_MIN, LDBL_MAX);
    printf("Åñlong double: %.20e Å` %.20e\n", LDBL_MIN, LDBL_MAX);

    return 0;
}//main()

/*
//====== Result ======
ÅüRange of Integer Type (in this Compiler)
Åñchar  : -128 Å` 127
Åñshort : -32768 Å` 32767
Åñint   : -2147483648 Å` 2147483647
Åñlong  : -2147483648 Å` 2147483647
Åñllong : -9223372036854775808 Å` 9223372036854775807

ÅüRange of Unsigned Integer defined by <stdint.h> 
Åñint8_t: -128 Å` 127
Åñuint8_t: 0 Å` 255
Åñint16_t: -32768 Å` 32767
Åñuint16_t: 0 Å` 65535
Åñint32_t: -2147483648 Å` 2147483647
Åñuint32_t: 0 Å` 4294967295
Åñint64_t: -9223372036854775808 Å` 9223372036854775807
Åñuint64_t: 0 Å` 18446744073709551616

ÅüRange of Float Double (in this Compiler)
Åñfloat : 0.0000000000000000000000000000000000000118 Å` 340282346638528859811704183484516925440.000000
Åñfloat :  1.17549435082228750797e-38 Å` 3.40282346638528859812e+38
Åñdouble: 0.0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000223
          Å` 179769313486231570814527423731704356798070567525844996598917476803157260780028538760589558632766878171540458953514382464234321326889464182768467546703537516986049910576551282076245490090389328944075868508455133942304583236903222948165808559332123348274797826204144723168738177180919299881250404026184124858368.000000
Åñdouble:  2.22507385850720138309e-308 Å` 1.79769313486231570815e+308
Åñlong double: 0.0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000223
          Å` 179769313486231570814527423731704356798070567525844996598917476803157260780028538760589558632766878171540458953514382464234321326889464182768467546703537516986049910576551282076245490090389328944075868508455133942304583236903222948165808559332123348274797826204144723168738177180919299881250404026184124858368.000000
Åñlong double:  2.22507385850720138309e-308 Å` 1.79769313486231570815e+308


*/
