/*
intの最小値・最大値、doubleの最小値・最大値を表示するプログラム
*/
#include <stdio.h>
#include <limits.h>
#include <float.h>

int main(void)
{
    printf("intの最小値：%i\n", INT_MIN);
    printf("intの最大値：%i\n", INT_MAX);
    printf("doubleの最小値：%f\n", DBL_MIN);
    printf("doubleの最大値：%f\n", DBL_MAX);

    return 0;
}//main

/*
intの最小値：-2147483648
intの最大値：2147483647
doubleの最小値：0.000000
doubleの最大値：1797693134862315708145274237317043567980705675258449965989174768031572607800285387605895586327668781715404589535143824642343213268894641827684675467035375169860499105765512820762454900903893289440758685084551339423045832369032229481658085593321233482747978262041447231
*/